meeting/minutes/2025/08-12.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>QT4 CG Meeting 132 Minutes 2025-08-12</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="/meeting/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="../../../css/style.css"/>
<link rel="shortcut icon" href="/img/QT4-64.png" />
<link rel="apple-touch-icon" sizes="64x64" href="/img/QT4-64.png" type="image/png" />
<link rel="apple-touch-icon" sizes="76x76" href="/img/QT4-76.png" type="image/png" />
<link rel="apple-touch-icon" sizes="120x120" href="/img/QT4-120.png" type="image/png" />
<link rel="apple-touch-icon" sizes="152x152" href="/img/QT4-152.png" type="image/png" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">QT4 CG Meeting 132 Minutes 2025-08-12</h1>
<p>
<a href="../">Meeting index</a> / <a href="https://qt4cg.org">QT4CG.org</a> / <a href="https://qt4cg.org/dashboard">Dashboard</a> / <a href="https://github.com/qt4cg/qtspecs/issues">GH Issues</a> / <a href="https://github.com/qt4cg/qtspecs/pulls">GH Pull Requests</a>
</p>

<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#minutes">Minutes</a></li>
<li><a href="#new-actions">Summary of new and continuing actions <code>[0/11]</code></a></li>
<li><a href="#administrivia">1. Administrivia</a>
<ul>
<li><a href="#roll-call">1.1. Roll call <code>[8/11]</code></a></li>
<li><a href="#agenda">1.2. Accept the agenda</a></li>
<li><a href="#approve-minutes">1.3. Approve minutes of the previous meeting</a></li>
<li><a href="#next-meeting">1.4. Next meeting</a></li>
<li><a href="#open-actions">1.5. Review of open action items <code>[2/9]</code></a></li>
<li><a href="#open-pull-requests">1.6. Review of open pull requests and issues</a>
<ul>
<li><a href="#blocked">1.6.1. Blocked</a></li>
<li><a href="#merge-without-discussion">1.6.2. Merge without discussion</a></li>
<li><a href="#close-without-action">1.6.3. Close without action</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#technical-agenda">2. Technical agenda</a>
<ul>
<li><a href="#pr-2116">2.1. PR #2116: 2112 Refine/revise the rules for get() in node tests</a></li>
<li><a href="#pr-2120">2.2. PR #2120: 2007 Revised design for xsl:array</a></li>
<li><a href="#pr-2156">2.3. PR #2156: 2092 Drop map:pair, map:of-pairs, map-pairs</a></li>
<li><a href="#pr-2155">2.4. PR #2155: 2150 Define patterns for JNodes</a></li>
<li><a href="#pr-2154">2.5. PR #2154: 2152 Revise rules for enumeration types</a></li>
<li><a href="#pr-2149">2.6. PR #2149: 2100 Make innermost, outermost, has-children, path apply to JNodes</a></li>
<li><a href="#pr-2147">2.7. PR #2147: 2143 Redesign of method calls</a></li>
<li><a href="#pr-2134">2.8. PR #2134: 1996 Lookups, KeySpecifier: Literal, ContextValueRef</a></li>
<li><a href="#pr-2133">2.9. PR #2133: 2132 error handling in logical expressions</a></li>
</ul>
</li>
<li><a href="#any-other-business">3. Any other business</a></li>
<li><a href="#adjourned">4. Adjourned</a></li>
</ul>
</div>
</div>
<div id="outline-container-minutes" class="outline-2">
<h2 id="minutes">Minutes</h2>
<div class="outline-text-2" id="text-minutes">
<p>
Approved <a href="../2025/08-19.html">at meeting 133</a> on 19 August 2025.
</p>
</div>
</div>
<div id="outline-container-new-actions" class="outline-2">
<h2 id="new-actions">Summary of new and continuing actions <code>[0/11]</code></h2>
<div class="outline-text-2" id="text-new-actions">
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> QT4CG-116-01: Add a specific error code for unsupported options on doc and doc-available</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-118-01: MK to make an incorrect type raise an error in #1906</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-127-01: NW to diagram the JTree representing arbitrary XDM content.</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-128-03: NW to compare the file: module against the equivalent XProc 3.1 steps</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-131-01: MK to add a non-schema aware result.</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-131-02: MK to expand on the <code>$E := &lt;e A="p q r"…</code> example</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-131-03: MK to change “invert” to “transpose” in the matrix example.</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-132-01: MK to add more examples for <code>innermost</code>, <code>outermost</code>, <code>has-children</code> and <code>path</code> with JNodes</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-132-02: MK to double-check the signature of <code>innermost</code></li>
<li class="off"><code>[&#xa0;]</code> QT4CG-132-03: MK to double-check stray text in h.i. in <code>path</code></li>
<li class="off"><code>[&#xa0;]</code> QT4CG-132-04: MK to add resize to the rectangle in the example of chaining method calls and flesh out the example.</li>
</ul>
</div>
</div>
<div id="outline-container-administrivia" class="outline-2">
<h2 id="administrivia"><span class="section-number-2">1.</span> Administrivia</h2>
<div class="outline-text-2" id="text-administrivia">
</div>
<div id="outline-container-roll-call" class="outline-3">
<h3 id="roll-call"><span class="section-number-3">1.1.</span> Roll call <code>[8/11]</code></h3>
<div class="outline-text-3" id="text-roll-call">
<p>
Regrets: BTW.
</p>

<ul class="org-ul">
<li class="on"><code>[X]</code> David J Birnbaum (DB)</li>
<li class="on"><code>[X]</code> Reece Dunn (RD)</li>
<li class="on"><code>[X]</code> Christian Grün (CG)</li>
<li class="on"><code>[X]</code> Joel Kalvesmaki (JK) [:15-]</li>
<li class="on"><code>[X]</code> Michael Kay (MK)</li>
<li class="off"><code>[&#xa0;]</code> Juri Leino (JLO)</li>
<li class="on"><code>[X]</code> John Lumley (JWL)</li>
<li class="on"><code>[X]</code> Wendell Piez (WP)</li>
<li class="off"><code>[&#xa0;]</code> Ed Porter (EP)</li>
<li class="off"><code>[&#xa0;]</code> Bethan Tovey-Walsh (BTW)</li>
<li class="on"><code>[X]</code> Norm Tovey-Walsh (NW) <i>Scribe</i>. <i>Chair</i>.</li>
</ul>
</div>
</div>
<div id="outline-container-agenda" class="outline-3">
<h3 id="agenda"><span class="section-number-3">1.2.</span> Accept the agenda</h3>
<div class="outline-text-3" id="text-agenda">
<p>
Proposal: Accept <a href="../../agenda/2025/08-12.html">the agenda</a>.
</p>

<p>
Accepted.
</p>
</div>
</div>
<div id="outline-container-approve-minutes" class="outline-3">
<h3 id="approve-minutes"><span class="section-number-3">1.3.</span> Approve minutes of the previous meeting</h3>
<div class="outline-text-3" id="text-approve-minutes">
<p>
Proposal: Accept <a href="../../minutes/2025/07-29.html">the minutes of the previous meeting</a>. 
</p>

<p>
Accepted.
</p>
</div>
</div>
<div id="outline-container-next-meeting" class="outline-3">
<h3 id="next-meeting"><span class="section-number-3">1.4.</span> Next meeting</h3>
<div class="outline-text-3" id="text-next-meeting">
<p>
The following meeting is scheduled for 19 August 2025.
</p>

<p>
No regrets heard.
</p>

<p>
(The CG will take a short recess in late August. We will <b>not</b> meet on 26 August,
2 September, or 9 September.)
</p>
</div>
</div>
<div id="outline-container-open-actions" class="outline-3">
<h3 id="open-actions"><span class="section-number-3">1.5.</span> Review of open action items <code>[2/9]</code></h3>
<div class="outline-text-3" id="text-open-actions">
<p>
(Items marked [X] are believed to have been closed via email before
this agenda was posted.)
</p>

<ul class="org-ul">
<li class="on"><code>[X]</code> QT4CG-082-02: DN to work with NW to come to agreement on the fn:ranks proposal
<ul class="org-ul">
<li>Overtaken by events</li>
</ul></li>
<li class="off"><code>[&#xa0;]</code> QT4CG-116-01: Add a specific error code for unsupported options on doc and doc-available</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-118-01: MK to make an incorrect type raise an error in #1906</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-127-01: NW to diagram the JTree representing arbitrary XDM content.</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-128-03: NW to compare the file: module against the equivalent XProc 3.1 steps</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-131-01: MK to add a non-schema aware result.</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-131-02: MK to expand on the <code>$E := &lt;e A="p q r"…</code> example</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-131-03: MK to change “invert” to “transpose” in the matrix example.</li>
<li class="on"><code>[X]</code> QT4CG-131-04: JK to double check the use of <code>&amp;lt;&amp;lt;</code> in the grammar where <code>&amp;gt;&amp;gt;</code> might have been intended</li>
</ul>
</div>
</div>
<div id="outline-container-open-pull-requests" class="outline-3">
<h3 id="open-pull-requests"><span class="section-number-3">1.6.</span> Review of open pull requests and issues</h3>
<div class="outline-text-3" id="text-open-pull-requests">
<p>
This section summarizes all of the issues and pull requests that need to be
resolved before we can finish. See <a href="#technical-agenda">Technical Agenda</a> below for the focus of this
meeting.
</p>
</div>
<div id="outline-container-blocked" class="outline-4">
<h4 id="blocked"><span class="section-number-4">1.6.1.</span> Blocked</h4>
<div class="outline-text-4" id="text-blocked">
<p>
The following PRs are open but have merge conflicts or comments which
suggest they aren’t ready for action.
</p>

<ul class="org-ul">
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2124">#2124</a>: 573 Functions to Construct Trees</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2120">#2120</a>: 2007 Revised design for xsl:array</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2019">#2019</a>: 1776: XSLT template rules for maps and array</li>
</ul>
</div>
</div>
