meeting/minutes/2025/08-12.org
*** Merge without discussion
:PROPERTIES:
:CUSTOM_ID: merge-without-discussion
:END:

The following PRs are editorial, small, or otherwise appeared to be
uncontroversial when the agenda was prepared. The chairs propose that
these can be merged without discussion. If you think discussion is
necessary, please say so.

+ PR [[https://qt4cg.org/dashboard/#pr-2158][#2158]]: 2157 Editorial updates to F+O §5.5 (Unicode collations)
+ PR [[https://qt4cg.org/dashboard/#pr-2146][#2146]]: Require at least one character in StringTemplateFixedPart
+ PR [[https://qt4cg.org/dashboard/#pr-2145][#2145]]: Allow implicit whitespace in StringInterpolation
+ PR [[https://qt4cg.org/dashboard/#pr-2141][#2141]]: Remove nested paragraphs
+ PR [[https://qt4cg.org/dashboard/#pr-2137][#2137]]: 2136 Drop full-width < and > symbols
+ PR [[https://qt4cg.org/dashboard/#pr-2135][#2135]]: QT4CG-131-01/02 Expand on example as actioned

Proposal: merge these PRs without discussion.

*** Close without action
:PROPERTIES:
:CUSTOM_ID: close-without-action
:END:

It has been proposed that the following issues be closed without action.
If you think discussion is necessary, please say so.

+ Issue [[https://github.com/qt4cg/qtspecs/issues/1852][#1852]]: fn:values-except: Return atomic values that occur in A but not in B
  + MK proposes closing on a value judgement; didn’t meet the minimum bar for
    adding the function. But that’s a personal judgement.
  + JWL: Easy enough to write your own?
  + MK: Yes.
  + CG: Background: we had some users who were asking for the function. They noticed that
    there’s no equivalent predicate solution that’s fast enough. 
    + … If you have a dedicated function, it’s easier to optimize. But we have maps and
      there are no other comments, so I’m fine with closing it.
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1698][#1698]]: Allow select attribute for xsl:call-template instruction
+ Issue [[https://github.com/qt4cg/qtspecs/issues/714][#714]]: Function annotations in XSLT
  + JWL: If you really want to do this you can pre-process the source code that contains a map.
  + MK: They wouldn’t be visible as annotations, but you can get the information.
  + JWL: You can do it yourself.
  + RD: That’s defining the equivalent of XQuery annotations on functions. Those are used in
    different places, like BaseX and other processors support REST XQ through annotations.
  + MK: There are two things here; being able to define annotations. You could
    do that with a vendor-defined extension attribute. The other is having the
    annotations available dynamically for interrogation. That’s subtle enough,
    we can leave users to design their own.
  + RD: I’ve used it in the past for roles.
  + MK: You can do that with extension attributes. It was a nice idea, but we can live without it.
  + RD: That means if you’re importing a function from XSLT, you can’t use the
    annotation mechanism in XQuery to interrogate the function.
  + WP: The more I hear, the more I’m with JWL. There are ways of doing this.
+ Issue [[https://github.com/qt4cg/qtspecs/issues/150][#150]]: fn:ranks: Produce all ranks in applying a function on the items of a sequence
  + PR [[https://qt4cg.org/dashboard/#pr-1062][#1062]]: 150bis revised proposal for fn:ranks

Proposal: close these issues and PRs without further action.

* Technical agenda
:PROPERTIES:
:CUSTOM_ID: technical-agenda
:END:

** PR #2116: 2112 Refine/revise the rules for get() in node tests
:PROPERTIES:
:CUSTOM_ID: pr-2116
:END:
See PR [[https://qt4cg.org/dashboard/#pr-2116][#2116]]

Defer until later. (Maybe later today, maybe next week.)

** PR #2120: 2007 Revised design for xsl:array
:PROPERTIES:
:CUSTOM_ID: pr-2120
:END:
See PR [[https://qt4cg.org/dashboard/#pr-2120][#2120]]

+ MK: Not ready for discussion. I need to rethink it.

** PR #2156: 2092 Drop map:pair, map:of-pairs, map-pairs
:PROPERTIES:
:CUSTOM_ID: pr-2156
:END:
See PR [[https://qt4cg.org/dashboard/#pr-2156][#2156]]

+ MK: We have too many ways to do things; I like these functions, but they are
  one-liners with JNodes. So let’s simplify the spec by dropping them.
+ JWL: I wonder if it’s worthwhile putting them in as examples somewhere.
+ MK: We could have a rag-bag appendix of functions in F&O.
+ WP: That would be awesome.

Proposal: accept this PR.

Accepted.

** PR #2155: 2150 Define patterns for JNodes
:PROPERTIES:
:CUSTOM_ID: pr-2155
:END:
See PR [[https://qt4cg.org/dashboard/#pr-2155][#2155]]

Defer until later.

** PR #2154: 2152 Revise rules for enumeration types
:PROPERTIES:
:CUSTOM_ID: pr-2154
:END:
See PR [[https://qt4cg.org/dashboard/#pr-2154][#2154]]

MK introduces the PR. Only the XPath and XQuery specs are effected.

+ MK: The only material change for users is that ~instance of~ now does the
  required thing.
  + … We still define them as a union of singleton enumerations
  + … But a singleton is no longer defined as a type derived from restriction,
    that stops ~instance of~ working.
  + … This defines it as a new kind of subtype of string.
  + … The main reason to change this is so that you can use ~instance of~ tests
    in XSLT Patterns because patterns don’t use coercion.
+ JWL: Is there any use case where people might want to use other collations?
+ MK: Maybe, but the consequences would be horrible.

Proposal: accept this PR.

Accepted.

** PR #2149: 2100 Make innermost, outermost, has-children, path apply to JNodes
:PROPERTIES:
:CUSTOM_ID: pr-2149
:END:
See PR [[https://qt4cg.org/dashboard/#pr-2149][#2149]]

MK introduces the PR.

+ MK: This generalizes a few more functions so that they work on JNodes.
  + … These could do with more examples. 

ACTION: QT4CG-132-01: MK to add more examples for ~innermost~, ~outermost~, ~has-children~ and ~path~ with JNodes
ACTION: QT4CG-132-02: MK to double-check the signature of ~innermost~

MK walks through the revised functions.

Some discussion of why ~has-children~ exists at all: streaming.

ACTION: QT4CG-132-03: MK to double-check stray text in h.i. in ~path~

Some discussion of where the “TODO” note is leading; will be resolved when we
sort out the question of JNodes and sequences.

Proposal: accept this PR.

Accepted.

MK will address the actions and then merge the PR.

