meeting/minutes/2025/08-12.html
<div id="outline-container-merge-without-discussion" class="outline-4">
<h4 id="merge-without-discussion"><span class="section-number-4">1.6.2.</span> Merge without discussion</h4>
<div class="outline-text-4" id="text-merge-without-discussion">
<p>
The following PRs are editorial, small, or otherwise appeared to be
uncontroversial when the agenda was prepared. The chairs propose that
these can be merged without discussion. If you think discussion is
necessary, please say so.
</p>

<ul class="org-ul">
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2158">#2158</a>: 2157 Editorial updates to F+O §5.5 (Unicode collations)</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2146">#2146</a>: Require at least one character in StringTemplateFixedPart</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2145">#2145</a>: Allow implicit whitespace in StringInterpolation</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2141">#2141</a>: Remove nested paragraphs</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2137">#2137</a>: 2136 Drop full-width &lt; and &gt; symbols</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2135">#2135</a>: QT4CG-131-01/02 Expand on example as actioned</li>
</ul>

<p>
Proposal: merge these PRs without discussion.
</p>
</div>
</div>
<div id="outline-container-close-without-action" class="outline-4">
<h4 id="close-without-action"><span class="section-number-4">1.6.3.</span> Close without action</h4>
<div class="outline-text-4" id="text-close-without-action">
<p>
It has been proposed that the following issues be closed without action.
If you think discussion is necessary, please say so.
</p>

<ul class="org-ul">
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1852">#1852</a>: fn:values-except: Return atomic values that occur in A but not in B
<ul class="org-ul">
<li>MK proposes closing on a value judgement; didn’t meet the minimum bar for
adding the function. But that’s a personal judgement.</li>
<li>JWL: Easy enough to write your own?</li>
<li>MK: Yes.</li>
<li>CG: Background: we had some users who were asking for the function. They noticed that
there’s no equivalent predicate solution that’s fast enough. 
<ul class="org-ul">
<li>… If you have a dedicated function, it’s easier to optimize. But we have maps and
there are no other comments, so I’m fine with closing it.</li>
</ul></li>
</ul></li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1698">#1698</a>: Allow select attribute for xsl:call-template instruction</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/714">#714</a>: Function annotations in XSLT
<ul class="org-ul">
<li>JWL: If you really want to do this you can pre-process the source code that contains a map.</li>
<li>MK: They wouldn’t be visible as annotations, but you can get the information.</li>
<li>JWL: You can do it yourself.</li>
<li>RD: That’s defining the equivalent of XQuery annotations on functions. Those are used in
different places, like BaseX and other processors support REST XQ through annotations.</li>
<li>MK: There are two things here; being able to define annotations. You could
do that with a vendor-defined extension attribute. The other is having the
annotations available dynamically for interrogation. That’s subtle enough,
we can leave users to design their own.</li>
<li>RD: I’ve used it in the past for roles.</li>
<li>MK: You can do that with extension attributes. It was a nice idea, but we can live without it.</li>
<li>RD: That means if you’re importing a function from XSLT, you can’t use the
annotation mechanism in XQuery to interrogate the function.</li>
<li>WP: The more I hear, the more I’m with JWL. There are ways of doing this.</li>
</ul></li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/150">#150</a>: fn:ranks: Produce all ranks in applying a function on the items of a sequence
<ul class="org-ul">
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1062">#1062</a>: 150bis revised proposal for fn:ranks</li>
</ul></li>
</ul>

<p>
Proposal: close these issues and PRs without further action.
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-technical-agenda" class="outline-2">
<h2 id="technical-agenda"><span class="section-number-2">2.</span> Technical agenda</h2>
<div class="outline-text-2" id="text-technical-agenda">
</div>
<div id="outline-container-pr-2116" class="outline-3">
<h3 id="pr-2116"><span class="section-number-3">2.1.</span> PR #2116: 2112 Refine/revise the rules for get() in node tests</h3>
<div class="outline-text-3" id="text-pr-2116">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-2116">#2116</a>
</p>

<p>
Defer until later. (Maybe later today, maybe next week.)
</p>
</div>
</div>
<div id="outline-container-pr-2120" class="outline-3">
<h3 id="pr-2120"><span class="section-number-3">2.2.</span> PR #2120: 2007 Revised design for xsl:array</h3>
<div class="outline-text-3" id="text-pr-2120">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-2120">#2120</a>
</p>

<ul class="org-ul">
<li>MK: Not ready for discussion. I need to rethink it.</li>
</ul>
</div>
</div>
<div id="outline-container-pr-2156" class="outline-3">
<h3 id="pr-2156"><span class="section-number-3">2.3.</span> PR #2156: 2092 Drop map:pair, map:of-pairs, map-pairs</h3>
<div class="outline-text-3" id="text-pr-2156">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-2156">#2156</a>
</p>

<ul class="org-ul">
<li>MK: We have too many ways to do things; I like these functions, but they are
one-liners with JNodes. So let’s simplify the spec by dropping them.</li>
<li>JWL: I wonder if it’s worthwhile putting them in as examples somewhere.</li>
<li>MK: We could have a rag-bag appendix of functions in F&amp;O.</li>
<li>WP: That would be awesome.</li>
</ul>

<p>
Proposal: accept this PR.
</p>

<p>
Accepted.
</p>
</div>
</div>
<div id="outline-container-pr-2155" class="outline-3">
<h3 id="pr-2155"><span class="section-number-3">2.4.</span> PR #2155: 2150 Define patterns for JNodes</h3>
<div class="outline-text-3" id="text-pr-2155">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-2155">#2155</a>
</p>

<p>
Defer until later.
</p>
</div>
</div>
<div id="outline-container-pr-2154" class="outline-3">
<h3 id="pr-2154"><span class="section-number-3">2.5.</span> PR #2154: 2152 Revise rules for enumeration types</h3>
<div class="outline-text-3" id="text-pr-2154">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-2154">#2154</a>
</p>

<p>
MK introduces the PR. Only the XPath and XQuery specs are effected.
</p>

<ul class="org-ul">
<li>MK: The only material change for users is that <code>instance of</code> now does the
required thing.
<ul class="org-ul">
<li>… We still define them as a union of singleton enumerations</li>
<li>… But a singleton is no longer defined as a type derived from restriction,
that stops <code>instance of</code> working.</li>
<li>… This defines it as a new kind of subtype of string.</li>
<li>… The main reason to change this is so that you can use <code>instance of</code> tests
in XSLT Patterns because patterns don’t use coercion.</li>
</ul></li>
<li>JWL: Is there any use case where people might want to use other collations?</li>
<li>MK: Maybe, but the consequences would be horrible.</li>
</ul>

<p>
Proposal: accept this PR.
</p>

<p>
Accepted.
</p>
</div>
</div>
<div id="outline-container-pr-2149" class="outline-3">
<h3 id="pr-2149"><span class="section-number-3">2.6.</span> PR #2149: 2100 Make innermost, outermost, has-children, path apply to JNodes</h3>
<div class="outline-text-3" id="text-pr-2149">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-2149">#2149</a>
</p>

<p>
MK introduces the PR.
</p>

<ul class="org-ul">
<li>MK: This generalizes a few more functions so that they work on JNodes.
<ul class="org-ul">
<li>… These could do with more examples.</li>
</ul></li>
</ul>

<p>
ACTION: QT4CG-132-01: MK to add more examples for <code>innermost</code>, <code>outermost</code>, <code>has-children</code> and <code>path</code> with JNodes
ACTION: QT4CG-132-02: MK to double-check the signature of <code>innermost</code>
</p>

<p>
MK walks through the revised functions.
</p>

<p>
Some discussion of why <code>has-children</code> exists at all: streaming.
</p>

<p>
ACTION: QT4CG-132-03: MK to double-check stray text in h.i. in <code>path</code>
</p>

<p>
Some discussion of where the “TODO” note is leading; will be resolved when we
sort out the question of JNodes and sequences.
</p>

<p>
Proposal: accept this PR.
</p>

<p>
Accepted.
</p>

<p>
MK will address the actions and then merge the PR.
</p>
</div>
</div>
