meeting/minutes/2025/08-12.org
** PR #2147: 2143 Redesign of method calls
:PROPERTIES:
:CUSTOM_ID: pr-2147
:END:
See PR [[https://qt4cg.org/dashboard/#pr-2147][#2147]]

The design of methods was just too baroque; CG made a simplification proposal.
Rather than overloading the ~?~ operator, we have a separate operator for
invoking methods.

+ MK: We introduce a new operator ~?>~. We can debate how to spell it later.
  + … No magic semantics for ~?~ anymore. Instead there’s a new expression.
+ MK: You can’t use partial function application in this case. It’s a simplification.
+ CG: I think I like this solution. Mostly we had different proposals; the other
  syntax was a little shorter but it wasn’t as composable.
+ JWL: Given the example with chaining and resize; would it not be worthwhile
  putting the resize method into the example.

ACTION: QT4CG-132-04: MK to add resize to the rectangle in the example of chaining method calls and flesh out the example.

+ JK: One of the examples that confuses me is the rectangle example.
  + … Area is defined in rectangle as a 1 arity function but it looks like you’re invoking a 0 arity function.
  + … Can you use ~area(.)~?
+ MK: No, like the arrow syntax it implicitly passes the first argument.
+ JK: If someone were to jigger the function, what are the rules?
+ MK: No, the map has to be the first argument and it’s implicitly set.
+ JK: More examples would help. An example that invites external parameters would also be helpful.
+ RD: The only reserved names are things like ~function~ and ~switch~.
+ MK: I’m not sure even those are reserved; they’re fine in the context of the record.
+ JWL: Thinking about resize; it has to produce a new rectangle that has to have
  an area method and a resize method and that needs a real example.
+ RD: You could potentially do that with a create helper.
+ JWL: It doesn’t matter how you do it, you need an example people can follow.

Some discussion of how it might be done: by constructing a new map or by using ~map:put~.

Proposal: accept this PR.

Accepted.

** PR #2134: 1996 Lookups, KeySpecifier: Literal, ContextValueRef
:PROPERTIES:
:CUSTOM_ID: pr-2134
:END:
See PR [[https://qt4cg.org/dashboard/#pr-2134][#2134]]

CG introduces the PR.

+ CG: In the old version a ~KeySpecifier~ had a few specific productions on the RHS.
+ CG: I generalized literals and added ~VarRef~.
+ MK: I have slight reservations about the use of ~.~. People might feel like
  ~?~ is very similar to ~/~ and ~/.~ would do something quite different.
+ CG: You can use variables and in my mind is that ~.~ is like that.
+ MK: Well, yes, but it changes implicitly in places.

Proposal: accept this PR.

Accepted.

** PR #2133: 2132 error handling in logical expressions
:PROPERTIES:
:CUSTOM_ID: pr-2133
:END:
See PR [[https://qt4cg.org/dashboard/#pr-2133][#2133]]

+ MK: I think this is a simple bug fix. We made the statement that with ~and~
  and ~or~ expressions that an error in the second operand is masked. We failed
  to carry that into the spec where we discuss those expressions.
+ RD: Don’t the tables make the paragraph that defines the semantic redundant?
+ MK: Yes, but I think it’s still valuable.

Proposal: accept this PR.

Accepted.

* Any other business
:PROPERTIES:
:CUSTOM_ID: any-other-business
:END:

None heard.

* Adjourned
:PROPERTIES:
:CUSTOM_ID: adjourned
:END:
