meeting/minutes/2025/08-12.html
<div id="outline-container-pr-2147" class="outline-3">
<h3 id="pr-2147"><span class="section-number-3">2.7.</span> PR #2147: 2143 Redesign of method calls</h3>
<div class="outline-text-3" id="text-pr-2147">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-2147">#2147</a>
</p>

<p>
The design of methods was just too baroque; CG made a simplification proposal.
Rather than overloading the <code>?</code> operator, we have a separate operator for
invoking methods.
</p>

<ul class="org-ul">
<li>MK: We introduce a new operator <code>?&gt;</code>. We can debate how to spell it later.
<ul class="org-ul">
<li>… No magic semantics for <code>?</code> anymore. Instead there’s a new expression.</li>
</ul></li>
<li>MK: You can’t use partial function application in this case. It’s a simplification.</li>
<li>CG: I think I like this solution. Mostly we had different proposals; the other
syntax was a little shorter but it wasn’t as composable.</li>
<li>JWL: Given the example with chaining and resize; would it not be worthwhile
putting the resize method into the example.</li>
</ul>

<p>
ACTION: QT4CG-132-04: MK to add resize to the rectangle in the example of chaining method calls and flesh out the example.
</p>

<ul class="org-ul">
<li>JK: One of the examples that confuses me is the rectangle example.
<ul class="org-ul">
<li>… Area is defined in rectangle as a 1 arity function but it looks like you’re invoking a 0 arity function.</li>
<li>… Can you use <code>area(.)</code>?</li>
</ul></li>
<li>MK: No, like the arrow syntax it implicitly passes the first argument.</li>
<li>JK: If someone were to jigger the function, what are the rules?</li>
<li>MK: No, the map has to be the first argument and it’s implicitly set.</li>
<li>JK: More examples would help. An example that invites external parameters would also be helpful.</li>
<li>RD: The only reserved names are things like <code>function</code> and <code>switch</code>.</li>
<li>MK: I’m not sure even those are reserved; they’re fine in the context of the record.</li>
<li>JWL: Thinking about resize; it has to produce a new rectangle that has to have
an area method and a resize method and that needs a real example.</li>
<li>RD: You could potentially do that with a create helper.</li>
<li>JWL: It doesn’t matter how you do it, you need an example people can follow.</li>
</ul>

<p>
Some discussion of how it might be done: by constructing a new map or by using <code>map:put</code>.
</p>

<p>
Proposal: accept this PR.
</p>

<p>
Accepted.
</p>
</div>
</div>
<div id="outline-container-pr-2134" class="outline-3">
<h3 id="pr-2134"><span class="section-number-3">2.8.</span> PR #2134: 1996 Lookups, KeySpecifier: Literal, ContextValueRef</h3>
<div class="outline-text-3" id="text-pr-2134">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-2134">#2134</a>
</p>

<p>
CG introduces the PR.
</p>

<ul class="org-ul">
<li>CG: In the old version a <code>KeySpecifier</code> had a few specific productions on the RHS.</li>
<li>CG: I generalized literals and added <code>VarRef</code>.</li>
<li>MK: I have slight reservations about the use of <code>.</code>. People might feel like
<code>?</code> is very similar to <code>/</code> and <code>/.</code> would do something quite different.</li>
<li>CG: You can use variables and in my mind is that <code>.</code> is like that.</li>
<li>MK: Well, yes, but it changes implicitly in places.</li>
</ul>

<p>
Proposal: accept this PR.
</p>

<p>
Accepted.
</p>
</div>
</div>
<div id="outline-container-pr-2133" class="outline-3">
<h3 id="pr-2133"><span class="section-number-3">2.9.</span> PR #2133: 2132 error handling in logical expressions</h3>
<div class="outline-text-3" id="text-pr-2133">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-2133">#2133</a>
</p>

<ul class="org-ul">
<li>MK: I think this is a simple bug fix. We made the statement that with <code>and</code>
and <code>or</code> expressions that an error in the second operand is masked. We failed
to carry that into the spec where we discuss those expressions.</li>
<li>RD: Don’t the tables make the paragraph that defines the semantic redundant?</li>
<li>MK: Yes, but I think it’s still valuable.</li>
</ul>

<p>
Proposal: accept this PR.
</p>

<p>
Accepted.
</p>
</div>
</div>
</div>
<div id="outline-container-any-other-business" class="outline-2">
<h2 id="any-other-business"><span class="section-number-2">3.</span> Any other business</h2>
<div class="outline-text-2" id="text-any-other-business">
<p>
None heard.
</p>
</div>
</div>
<div id="outline-container-adjourned" class="outline-2">
<h2 id="adjourned"><span class="section-number-2">4.</span> Adjourned</h2>
<div class="outline-text-2" id="text-adjourned">
</div>
</div>
</div>
</body>
</html>
